In [1]:
import pandas as pd

In [4]:
df = pd.read_excel("data.xlsx", sheet_name="工作表1")

In [5]:
df

   姓名  年龄   身高
0  张三  23  1.7
1  李四  34  1.8
2  王二  12  1.3

In [6]:
df["姓名"]

0    张三
1    李四
2    王二
Name: 姓名, dtype: object

In [7]:
df["身高"]

0    1.7
1    1.8
2    1.3
Name: 身高, dtype: float64

In [9]:
df.loc[0]

姓名     张三
年龄     23
身高    1.7
Name: 0, dtype: object

series

In [10]:
type(df["身高"])

pandas.core.series.Series

In [11]:
s = pd.Series([1, 2, 3])

In [12]:
s

0    1
1    2
2    3
dtype: int64

In [13]:
s[0]

1

In [14]:
s[1]

2

In [15]:
s = pd.Series({"a":1, "b":2, "c":3})

In [16]:
s

a    1
b    2
c    3
dtype: int64

In [17]:
s["a"]

1

In [18]:
s["b"]

2

In [19]:
s["c"]

3

In [20]:
s + s

a    2
b    4
c    6
dtype: int64

In [21]:
s + 7

a     8
b     9
c    10
dtype: int64

dataframe

In [23]:
import numpy as np

In [25]:
pd.DataFrame(np.random.rand(3, 4), columns=["A","B","C","D"])

          A         B         C         D
0  0.422967  0.436594  0.453914  0.137654
1  0.675928  0.347866  0.599699  0.474305
2  0.068934  0.807803  0.620098  0.698632

In [27]:
df = pd.DataFrame(np.random.rand(3, 4), columns=["A","B","C","D"], index=["a", "b", "c"])

In [28]:
df

          A         B         C         D
a  0.472195  0.655286  0.937220  0.030727
b  0.544764  0.275677  0.329657  0.428237
c  0.479704  0.226174  0.066945  0.928650

In [29]:
df["A"]

a    0.472195
b    0.544764
c    0.479704
Name: A, dtype: float64

In [30]:
df.loc["a"]

A    0.472195
B    0.655286
C    0.937220
D    0.030727
Name: a, dtype: float64

In [31]:
df.A

a    0.472195
b    0.544764
c    0.479704
Name: A, dtype: float64

In [32]:
df["A"]

a    0.472195
b    0.544764
c    0.479704
Name: A, dtype: float64

In [33]:
df.to_csv("data.csv")

In [43]:
df1 = pd.read_csv("data.csv", index_col=0, skiprows=1)

In [44]:
df1

          A         B         C         D
a  0.472195  0.655286  0.937220  0.030727
b  0.544764  0.275677  0.329657  0.428237
c  0.479704  0.226174  0.066945  0.928650